'use strict';

/* Переверните массив
Создайте функцию reverseArray, которая будет принимать массив чисел и возвращать зеркальный массив

Основные требования:
Функция должна называться reverseArray
Функция должна вернуть null, если в качестве аргумента передан не массив
Если аргумент - массив, то функция должна вернуть массив, где первый элемент стал последним, второй предпоследний, ... , последний - первым
Исходный массив не должен поменяться
Используйте методы массивов для решения текущей задачи. Циклы for и while здесь использовать не нужно 
 */
const arr = [1, 2, 3, 4, 5, 6];

const reverseArray = arr => {
    if(!Array.isArray(arr)) {
        return null;
    }
    return [...arr].reverse();
}

console.log(reverseArray(arr))
console.log(arr)

