/**
 Массив случайных чисел
Создайте функцию, которая будет возвращать массив целых случайных чисел из заданного промежутка

Основные требования:
Функция должна называться getRandomNumbers
Функция должна принимать 3 аргумента:
число (целое) - длину результирующего массива
число (может быть дробное, положительное и отрицательное) - начало промежутка
число (может быть дробное, положительное и отрицательное) - конец промежутка,больше начала промежутка
Функция должна вернуть массив заданной длины, элементы которого - целые случайные числа в заданном промежутке
Верните null, если в заданном промежутке нету целых чисел
Подсказки:
Для нахождения случайных чисел в промежутке используйте формулу: начало промежутка (start) + случайная часть от длины промежутка (end - start)
Нужно применять разное округление (Math.ceil или Math.floor) в зависимости от того, число положительное или отрицательное
 */
// input: num, num, num
// output: arr or null


const getRandomNumbers = (len, min, max) => {
    if (Math.abs(max - min) > 1) {
       return Array(len).fill().map(() => {
            if (min > 0 && max > 0) {
                return Math.floor(Math.random() * (max - min) + min);
            }

            return Math.ceil(Math.random() * (max - min) + min);
        });
    }

    return null;
}

console.log(getRandomNumbers(10, 2, 8));

