'use strict';

/* Нахождение среднего
Напишите функцию которая будет находить среднее арифметическое элементов масссива

Основные требования:
Функция должна называться arrAverage(arr)
Функция должна вернуть null, если в качестве аргумента передан не массив
Если аргумент - массив, то функция должна возвращать среднее арифметическое элементов масссива
Используйте метод массивов reduce для решения текущей задачи. Циклы for и while здесь использовать не нужно

Пример работы:
Input: arrAverage([2, 5, 6, 3])
Output: 4
 */

const arrAverage = arr => { 
    if (!Array.isArray(arr)) {
        return null;
    }

    return arr.reduce((acc, el) => acc + el) / arr.length;  
}

console.log(arrAverage([2, 5, 6, 3]));
