/*Очистка данных о транзакциях
На вход ф-ции поступают данные в виде массива, элементами которого являются суммы совершенных транзакций. Но данные не очень качественны и могут содержать лишние пробелы или даже не числа. Функция должна отсечь лишнее и вернуть только полезные и отформатированные данные

Основные требования:
Функция должна называться cleanTransactionsList
Функция должна принимать как аргумент массив транзакций (['  1.9 ', '16.4', 17, ' 1 dollar '])
Если элемент содержит буквы - отбросить его
Если элемент содержит пробелы - обрезать пробелы в начале и в конце
Вернуть массив в формате (['$1.90', '$16.40', '$17.00'])
Каждый элемент результирующего массива должен быть строкой, начинаться с $ и сумма должна иметь строго 2 знака после запятой
Исходный массив должен остаться неизменным */
const arr = ['  a1.9 ', '16.4', 17, '1 dollar '];

// const cleanTransactionsList = arr => {
//     let cleaned = [];
    
//     arr.forEach(el => {
//         if (!/[a-zA-Z]/.test(el) ) {
//             cleaned.push('$' + parseFloat(el).toFixed(2));
//         }
//     });
//     return cleaned;
// }

const cleanTransactionsList = arr => {
  return arr.filter(el => !/[a-zA-Z]/.test(el))
    .map(el => '$' + parseFloat(el).toFixed(2));
}
  
console.log(cleanTransactionsList(arr));