/*Фильтрация объекта
Создайте функцию, которая найдет в объекте всех людей, которым исполнилось 18 лет

Основные требования:
Функция с именем getAdults должна принимать объект вида { 'John Doe': 19, 'Tom': 17, 'Bob': 18 }, где ключ - имя человека, значение - его возраст
Функция должна вернуть объект, который содержит только тех, кто достиг 18 лет
Для пустого объекта ф-ция должна вернуть пустой объект
Пример работы: { 'John Doe': 19, 'Tom': 17, 'Bob': 18 } => { 'John Doe': 19, 'Bob': 18 }
Исходный объект должен остаться неизменным
*/

const getAdults = obj => {
    let adults = {};
    for (let key in obj) {
        if (obj[key] >= 18) {
          adults[key] = obj[key];
        }
    }

    return adults;
}

console.log(getAdults({ 'John Doe': 19, 'Tom': 17, 'Bob': 18 }));